{
  "title": "Curs Angular",
  "cercar": "Cercar",
  "netejar.filtre": "Netejar filtre",
  "tots": "Tots",

  "que.es": "Que és?",
  "representacio.title": "Es pot representar de varies formes:",
  "representacio.single.title": "Es representa de la següent forma:",


  "angular.binding.oneway.explicacio": "Aquest tipus de binding serveix per a imprimir dades del component Angular a la pantalla.",
  "angular.binding.oneway.on": "On <code>expression</code> es el valor que es vol imprimir, ja sigui una variable o un càlcul, i <code>target</code> és l'atribut on es vol aplicar l'expressió.",

  "angular.binding.onewaybind.explicacio": "Aquest tipus de binding serveix per a enviar dades de la vista cap al component Angular. Es sol fer servir per cridar accions depenent dels esdeveniments que ocorrin a la vista.",
  "angular.binding.onewaybind.on": "On <code>expression</code> es el valor que es vol enviar, ja sigui una variable o un càlcul, i <code>target</code> és l'atribut on es vol aplicar l'expressió, normalment esdeveniments.",

  "angular.binding.twoway.explicacio": "Aquest tipus de binding serveix per enviar i rebre dades de la vista al component. Si es canvia el valor en la vista s'actualitzarà la variable corresponent al component i viceversa.",
  "angular.binding.twoway.on": "On <code>expression</code> és el valor que es vol imprimir, normalment una variable, i <code>target</code> és l'atribut on es vol aplicar l'expressió.",

  "angular.directives.ngif.explicacio": "<i>ngIf</i> és una directiva que permet mostrar o no codi HTML depenent de la condició que se li fiqui.",
  "angular.directives.ngif.on": "On <code>condition</code> és la condició per a que és mostri o no l'HTML i <code>content</code> és el contigut que es mostrarà en cas de que la condició es compleixi.",
  "angular.directives.ngif.else.explicacio": "<i>ngIf</i> també pot mostrar un altre HTML en cas de que la condició no es compleixi.",
  "angular.directives.ngif.else.on": "On <code>condition</code> és la condició per a que és mostri o no l'HTML, <code>content</code> és el contigut que es mostrarà en cas de que la condició es compleixi, <code>templateId</code> és la ID del <code>ng-template</code> que es mostrarà en cas de que la condició no es compleixi i <code>elsecontent</code> és el contigut d'aquest <code>ng-template</code>.",
  "angular.directives.ngif.then.explicacio1": "Finalment, al <i>ngIf</i> també se li pot indicar que dibuixi un bloc indicar en comptes del contigut del tag on és el <i>ngIf</i>.",
  "angular.directives.ngif.then.on": "On <code>condition</code> és la condició per a que és mostri o no l'HTML, <code>templateId</code> és la ID del <code>ng-template</code> que es mostrarà en cas de que la condició es compleixi, <code>thencontent</code> és el contigut d'aquest <code>ng-template</code>, <code>elseTemplateId</code> és la ID del <code>ng-template</code> que es mostrarà en cas de que la condició no es compleixi i <code>elsecontent</code> és el contigut d'aquest últim <code>ng-template</code>.",
  "angular.directives.ngif.then.explicacio2": "Amb el <i>then</i> el contingut del tag on estigui el <i>ngIf</i> no és mostrarà mai.",
  "angular.directives.ngif.nomes.ngtemplate": "Només vàlid en el tag ng-template",

  "angular.directives.ngfor.explicacio": "<i>ngFor</i> és una directiva que permet repetir codi HTML per cada element existent en una llista d'elements.",
  "angular.directives.ngfor.on": "On <code>array</code> és la llista d'elements a iterar i <code>element</code> és la variable assignada a l'element actual de la iteració.",
  "angular.directives.ngfor.vars.title": "Variables auxiliars",
  "angular.directives.ngfor.vars.explicacio1": "<i>ngFor</i> conté variables auxiliars que ens proporcionen informació de l'element actual el de la iteració. Són els següents:",
  "angular.directives.ngfor.vars.explicacio2": "Per poder fer servir aquestes variables se'ls hi ha d'assignar un alies, els quals es poden declarar de les següents formes:",
  "angular.directives.ngfor.vars.index": "Índex de la iteració començant per 0.",
  "angular.directives.ngfor.vars.first": "Booleà que retornarà <code>true</code> si l'element actual és el primer de la iteració.",
  "angular.directives.ngfor.vars.last": "Booleà que retornarà <code>true</code> si l'element actual és l'últim de la iteració.",
  "angular.directives.ngfor.vars.odd": "Booleà que retornarà <code>true</code> si l'element actual de la iteració és par (segon, quart, etc).",
  "angular.directives.ngfor.vars.even": "Booleà que retornarà <code>true</code> si l'element actual de la iteració és impar (primer, tercer, etc).",
  "angular.directives.ngfor.vars.on": "On <code>variable</code> és la variable auxiliar que es vol utilitzar i <code>alias</code> és el nom que se li assignarà a la variable per tal de poder-la fer servir.",
  "angular.directives.ngfor.exemple.element": "Element",
  "angular.directives.ngfor.exemple.index": "Índex",
  "angular.directives.ngfor.exemple.esprimer": "És el primer?",
  "angular.directives.ngfor.exemple.esultim": "És l'últim?",
  "angular.directives.ngfor.exemple.espar": "És element par?",
  "angular.directives.ngfor.exemple.esimpar": "És element impar?",

  "angular.routing.explicacio1": "El <i>routing</i> és la forma de dir-li a Angular quins components es faràn servir depenent de les rutes per on vagi navegant l'usuari.",
  "angular.routing.explicacio2": "Quan es crea un projecte nou amb Angular Cli aquest et pregunta si el vols implementar, crean-te el fitxer <code>src/app/app-routing.module.ts</code>, per poder configurar les diferents rutes, i configurant-te el <code>src/app/app.module.ts</code>.",
  "angular.routing.explicacio3": "En cas de no haver generat el fitxer amb Angular Cli podem configurar el projecte manualment.",

  "angular.routing.config.title": "Configurar el projecte per a acceptar rutes",
  "angular.routing.config.subtitle": "Alternativa curta",
  "angular.routing.config.explicacio1": "Primer de tot crearem el fitxer <code>src/app/app-routing.module.ts</code> el qual ha de tenir el següent aspecte:",
  "angular.routing.config.explicacio2": "Tot seguit l'incorporem al <code>src/app/app.module.ts</code>:",
  "angular.routing.config.explicacio3": "A partir d'aquí ja podem configurar les rutes per al nostre projecte.",
  "angular.routing.config.explicacio4": "Una alternativa és configurar-ho tot directament al fitxer <code>src/app/app-routing.module.ts</code>",

  "angular.routing.rutes.title": "Configuració de les rutes",
  "angular.routing.rutes.explicacio1": "Les rutes es configuren en el fitxer <code>src/app/app-routing.module.ts</code>, dins de la variable routes.",
  "angular.routing.rutes.explicacio2": "Cada ruta estarà definida dins de claus(<code>{ }</code>) i pot tenir els següents paràmetres:",

  "angular.routing.rutes.taula.path": "És la ruta a la qual podràs navegar-hi. Se li poden passar paràmetres o expressions regulars.",
  "angular.routing.rutes.taula.component": "És el component que s'executarà al accedir a la ruta definida, juntament amb el seu HTML.",
  "angular.routing.rutes.taula.redirectTo": "En comptes de definir un component podem redirigir a una altre ruta.",
  "angular.routing.rutes.taula.canActivate": "Classe que imlementa CanActivate, la qual podrem programar per a que validi el que ens sigui necessari en la aplicació per tal de discernir si l'usuari pot accedir a la ruta o no.",

  "angular.routing.rutes.exemple1": "La primera configuració, quan la ruta sigui <code>/login</code>, activarà el component <i>LoginComponent</i> i el <i>Router Outlet</i> el pintarà.",
  "angular.routing.rutes.exemple2": "La segona configuració, quan la ruta sigui <code>/welcome</code>, activarà el component <i>WelcomeComponent</i> i el <i>Router Outlet</i> el pintarà si el AuthGuardService valida l'accès correctament.",
  "angular.routing.rutes.exemple3": "La tercera configuració, quan la ruta sigui <code>/notes</code>, activarà el component <i>NotesComponent</i> i el <i>Router Outlet</i> el pintarà si el AuthGuardService valida l'accès correctament.</li>",
  "angular.routing.rutes.exemple4": "La quarta configuració, quan la ruta sigui <code>/note/</code> seguida d'un identificador (per exemple <code>/note/3</code>), activarà el component <i>NoteComponent</i> i el <i>Router Outlet</i> el pintarà si el AuthGuardService valida l'accès correctament.",
  "angular.routing.rutes.exemple5": "La última configuració fa que la resta de rutes que no concordin amb les anteriors configuracions redirigeixin a <i>notes</i> i la seva configuració.",

  "angular.routing.can.activate.title": "Can Activate",
  "angular.routing.can.activate.explicacio": "El Can Activate es una classe la qual ha d'implementar un servei. Aquest ha de tenir una funció canActivate() la qual haurà de realitzar les validacions necessaries per discernir si l'usuari té accès o no a la ruta i retornar true o false depenent de la validació. També es poden realitzar accions depenent del resultat, com ara fer una redirecció si l'usuari no te accès a la ruta que ha sol·licitat.",
  "angular.routing.can.activate.exemple": "Aquesta classe validarà si se li ha inserit un usuari (des d'algún component que importi el servei) i, si no és així, redirigirà a <i>login</i>.",

  "angular.routing.location.strategy.menu": "Routing: Estratègia de localització",
  "angular.routing.location.strategy.title": "Estratègia de localització",
  "angular.routing.location.strategy.explicacio": "Angular té dues estrategies a l'hora de tractar les URL quan es navega per l'aplicació: PathLocationStrategy i HashLocationStrategy",
  "angular.routing.location.strategy.path1": "Amb aquesta configuració la ruta funciona de forma estandard. Un exemple seria el seguent:",
  "angular.routing.location.strategy.path2": "On <code>my-app</code> seria la ruta principal de l'aplicació i <code>welcome</code> un component dins l'aplicació.",
  "angular.routing.location.strategy.path3": "Aquesta configuració provoca que les rutes que no siguin l'arrel donin un error 404 si s'intenta accedir directament en comptes de navegar per l'aplicació. Per a que la resta de rutes funcionin s'hauria de configurar el servidor per a que redirigeixi al index.html.",
  "angular.routing.location.strategy.path4": "El PathLocationStrategy és la configuració per defecte en Angular, però es pot configurar manualment modificant el RouterModule de la següent forma:",
  "angular.routing.location.strategy.hash1": "Amb aquesta configuració la ruta funciona a partir d'un hash (<code>#</code>). Un exemple seria el seguent:",
  "angular.routing.location.strategy.hash2": "On <code>my-app</code> seria la ruta principal de l'aplicació i <code>welcome</code> un component dins l'aplicació.",
  "angular.routing.location.strategy.hash3": "Aquesta configuració és la més senzilla d'utilitzar ja que no requereix de configuracions del servidor.",
  "angular.routing.location.strategy.hash4": "El HashLocationStrategy no està configurat per defecte en Angular, pel que s'ha de configurar modificant el RouterModule de la següent forma:",

  "angular.routing.navigation.menu": "Routing: Navegació",
  "angular.routing.navigation.title": "Navegació",
  "angular.routing.navigation.explicacio": "Un cop configurada la nostre aplicació per a poder navegar entre diferents components podem programar-la per poder-hi navegar.",
  "angular.routing.navigation.router.outlet1": "El <i>router outlet</i> és el tag que es fa servir per indicar-li a Angular on ha de posar el component que pertoqui segons la url. Per defecte, si em configurat el projecte amb rutes mitjançant l'Angular CLI, Angular el posa a <code>src/app/app.component.html</code>. Té el següent aspecte:",
  "angular.routing.navigation.router.outlet2": "Aquest tag es pot posar on es vulgui, però només es pot posar un, si se'n posa més Angular només agafarà el primer que trobi quan renderitzi l'aplicació.",
  "angular.routing.navigation.router.link": "El <i>router link</i> és un atribut per al tag <code>a</code> que serveix per indicar a quin component redirigirà l'enllaç. Es pot posar directament si només se li vol posar el path o entre claudàtors (<code>[]</code>) si se li vol passar una variable i/o paràmetres de ruta.",
  "angular.routing.navigation.router.link.exemple1": "L'enllaç redirigirà al path <i>link</i> que s'hagi configurat al RouterModule.",
  "angular.routing.navigation.router.link.exemple2": "L'enllaç redirigirà al path que s'hagi configurat al RouterModule que correspongui al valor de la variable del component <i>link</i>.",
  "angular.routing.navigation.router.link.exemple3": "L'enllaç redirigirà al path <i>link</i>, amb un paràmetre amb el valor que contingui la variable <i>id</i>, que s'hagi configurat al RouterModule.",
  "angular.routing.navigation.router.link.exemple4": "L'enllaç redirigirà al path que s'hagi configurat al RouterModule que correspongui al valor de la variable del component <i>link</i> amb un paràmetre amb el valor que contingui la variable <i>id</i>.",
  "angular.routing.navigation.router.link.active1": "El <i>router link active</i> és un atribut per al tag <code>a</code> o el seu tag pare que serveix per aplicar la classe indicada en cas de que l'usuari estigui a la mateixa ruta que la que indiqui el <i>router link</i>.",
  "angular.routing.navigation.router.link.active2": "Pot anar acompanyat de <code>[routerLinkActiveOptions]=\"{exact: true}\"</code> si es vol que s'apliqui només quan la ruta sigui exacte.",
  "angular.routing.navigation.router.link.active.exemple1": "Si l'usuari és a <code>/link</code> se li aplicarà la classe <i>activated</i> al tag <code>a</code>.",
  "angular.routing.navigation.router.link.active.exemple2": "Si l'usuari és a <code>/link/1</code> se li aplicarà la classe <i>activated</i> al tag <code>a</code>.",
  "angular.routing.navigation.router.link.active.exemple3": "Si l'usuari és a <code>/link</code> se li aplicarà la classe <i>activated</i> al tag <code>div</code>.",
  "angular.routing.navigation.router.link.active.exemple4": "Si l'usuari és exactament <code>/link/1</code> se li aplicarà la classe <i>activated</i> al tag <code>a</code>.",
  "angular.routing.navigation.router": "El <i>router</i> es una classe que es pot importar a qualsevol component o servei per tal de poder redirigir de pàgina en les funcions typescript. També es pot fer servir per consultar la ruta actual.",
  "angular.routing.navigation.router.exemple1": "Exemple de redirecció simple:",
  "angular.routing.navigation.router.exemple2": "Exemple de redirecció passant un paràmetre:",
  "angular.routing.navigation.router.exemple3": "Exemple de consulta de la ruta actual:",

  "angular.routing.get.params.menu": "Routing: Recuperar paràmetres de la ruta",
  "angular.routing.get.params.title": "Recuperar paràmetres de la ruta",
  "angular.routing.get.params.explicacio": "Quan s'accedeixen a rutes a les quals se'ls hi passa un o varis paràmetres per la ruta, aquests es poden recuperar en el component de la següent forma:",

  "angular.routing.exemple.menu": "Routing: Exemple d'aplicació amb routing",
  "angular.routing.exemple.title": "Exemple d'aplicació amb routing",
  "angular.routing.exemple.explicacio1": "Crearem una aplicació que mostrarà una llista de notes y podrem accedir a cada una d'elles per veure'n el nom. Aquesta pantalla tindrà a una pantalla de login la qual serà l'unica a la que tindrem accès si no ens em identificat.",
  "angular.routing.exemple.explicacio2": "Definim les rutes al <code>app.module.ts</code> amb els seus components.",
  "angular.routing.exemple.explicacio3": "Totes les pantalles menys login tindràn un <code>canActivate</code> que ens impedirà l'accès dels que no s'identifiquin.",
  "angular.routing.exemple.explicacio4": "Posarem també un redirect per a les rutes no tractades, que reridigirà a 'notes'.",
  "angular.routing.exemple.explicacio5": "Crearem el servei <code>AuthGuardService</code> que implementarà <code>CanActivate</code>.",
  "angular.routing.exemple.explicacio6": "La funció <code>canActivate()</code> serà la que definirà quan es té accès, redirigint al login en cas contrari.",
  "angular.routing.exemple.explicacio7": "Definirem el component principal. Aquí crearem 3 enllaços: el primer anirà al <i>welcome</i>, el segon a <i>notes</i> i el tercer llançarà una funció que ens tancarà la sessió i ens redirigirà a login. Amb el router també controlarem la ruta actual per mostrar o no els enllaços.",
  "angular.routing.exemple.explicacio8": "Definirem el component de login amb la funció que ens autenticarà i, en cas de que l'autenticació sigui correcte, desarà l'usuari al servei <code>AuthGuardService</code> i ens redirigirà a 'notes'.",
  "angular.routing.exemple.explicacio9": "Definirem el component de benvinguda que recuperarà l'usuari de <code>AuthGuardService</code> i ens saludarà.",
  "angular.routing.exemple.explicacio10": "Definirem el component de notes al qual simplement li afegirem un llistat de notes amb una id i un nom cada una.",
  "angular.routing.exemple.explicacio11": "Finalment definirem el component <i>note</i> al qual simplement recuperarem el <i>id</i> de la ruta i l'imprimirem.",

  "si": "Sí",
  "no": "No",
  "salutacio": "hola",
  "saludar": "saludar",
  "parametre": "Paràmetre",
  "tipus": "Tipus",
  "variable": "Variable",
  "explicacio": "Explicació",
  "resultat": "Resultat",
  "mateix.component": "mateix component",
  "exemple": "Exemple",
  "exemples": "Exemples",
  "exemple.descarregar": "Descarregar exemple",
  "component": "Component",
  "vista": "Vista",
  "resultat.escriviu": "escriviu dins dels camps",
  "or": "O"
}
